#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.rds.aws_security_group.this: Refreshing state... [id=sg-08ac515ab6e8ebdf7]
module.rds.aws_key_pair.mmm2: Refreshing state... [id=mmm2]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0b9c9dcab97f3491c]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:cluster/line-bot-sample2]
module.rds.aws_ssm_parameter.database_password_secret: Refreshing state... [id=MYSQL_PASSWORD]
module.rds.aws_rds_cluster_parameter_group.this: Refreshing state... [id=linebot-sample2-rds-mysql]
module.route53.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/06e7b54e-fc23-4c2b-8939-aabde5bbb683]
module.ecr-app.aws_ecr_repository.main: Refreshing state... [id=line-bot-sample2-app]
module.ecs.aws_cloudwatch_log_group.line-bot-sample2: Refreshing state... [id=/aws/ecs/line-bot-sample2]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=EcsTaskRole-line-bot-sample2]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_for_ecr: Refreshing state... [id=EcsTaskRole-line-bot-sample2-20210429021106029600000001]
module.route53.aws_route53_record.validations["line-bot-sample2.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net._CNAME]
module.ecs.aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=EcsTaskRole-line-bot-sample2:cloudwatch_logs]
module.rds.aws_iam_role_policy.mysql_db_password_policy_secretsmanager: Refreshing state... [id=EcsTaskRole-line-bot-sample2:password-policy-mysql_db_password_policy_secretsmanager]
module.route53.aws_acm_certificate_validation.main: Refreshing state... [id=2021-04-27 09:08:01 +0000 UTC]
module.ecr-app.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05f06bcd8be5135ea]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-0829c8222f3c2e3f0]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-0f70a7f400318b4fa]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-0a31ed301afa10c9e]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0db9d7fef1d452a9f]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-0a3c585bbf6bba58b]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0833e5cbb3feed7c4]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-0bb63a2f82ac5687b]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-0b7249501f7f39f80]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-03c288199d18a8e45]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/line-bot-sample2-target-group/85c2e8b8911549f7]
module.ecr-app.aws_security_group.vpc_endpoint: Refreshing state... [id=sg-096192166d6f9cd8b]
module.rds.aws_security_group.vpc_endpoint_rds: Refreshing state... [id=sg-0ce678efdd64b44e5]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-071a11b51c485b0b1]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-0d00944d99dfe3fb9]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-02c271aaae088ea4b]
module.ecs.aws_security_group.ecs: Refreshing state... [id=sg-071dd337cfbbbb50d]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-0833e5cbb3feed7c41080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05e859eb1301e09d1]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dfdb12fab7d4006a]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f51279304586a58e]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[1]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea46037175]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[2]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea2941716146]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[0]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea3530383921]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/line-bot-sample2/2d23d36ec59ecb9b]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-0840d58339cd83f90]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-0a74d87da37cd4c32]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-0c7b9baba708642b6]
module.ecr-app.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-060745b09df69e96a]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=linebot-sample2-rds-mysql]
module.ecr-app.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-0aa2aa645cd78c54a]
module.ecr-app.aws_vpc_endpoint.cloudwatch: Refreshing state... [id=vpce-0aada49a067e44d0b]
module.ecr-app.aws_vpc_endpoint.ssm: Refreshing state... [id=vpce-0685661311e6eb46b]
module.ecr-app.aws_vpc_endpoint.cloudwatch_logs: Refreshing state... [id=vpce-0d26e22adef0a927d]
module.rds.aws_vpc_endpoint.rds: Refreshing state... [id=vpce-08152a4039ea057bd]
module.rds.aws_rds_cluster.this: Refreshing state... [id=linebot-sample2-rds-mysql]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/2d23d36ec59ecb9b/f629bb67277bf261]
module.alb.aws_lb_listener.http_to_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/2d23d36ec59ecb9b/cb9619fbb54169cb]
module.route53.aws_route53_record.main: Refreshing state... [id=Z04052072YGY8CIREK2A2_line-bot-sample2.moikilo00.net_A]
module.alb.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener-rule/app/line-bot-sample2/2d23d36ec59ecb9b/f629bb67277bf261/d135b6a132b7b048]
module.ecs.aws_ecs_task_definition.main: Refreshing state... [id=line-bot-sample2-task-definition]
module.rds.aws_rds_cluster_instance.this: Refreshing state... [id=linebot-sample2-rds-mysql]
module.ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:service/line-bot-sample2/line-bot-sample2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.data.template_file.container_definitions will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "container_definitions"  {
      ~ id       = "f1fd9af55a8bb374a48214ec9c8941e182093767848ffae550cf53ad5474d4ca" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "DB_DATABASE"
                          - value = "linebotsample2database"
                        },
                      - {
                          - name  = "DB_USER"
                          - value = "user"
                        },
                      - {
                          - name  = "DB_ADDRESS"
                          - value = "linebot-sample2-rds-mysql.cluster-cdx787qeoakd.ap-northeast-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "DB_PORT"
                          - value = "3306"
                        },
                      - {
                          - name  = "CONTAINER_TAG"
                          - value = "0.0.1-b3b9e8d"
                        },
                    ]
                  - image            = "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/line-bot-sample2-app:0.0.1-b3b9e8d"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/line-bot-sample2"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - name             = "line-bot-sample2-app"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "DB_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/MYSQL_PASSWORD"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          ~ "db_address"           = "linebot-sample2-rds-mysql.cluster-cdx787qeoakd.ap-northeast-1.rds.amazonaws.com" -> (known after apply)
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ap-northeast-1:554506578892:service/line-bot-sample2/line-bot-sample2"
        name                               = "line-bot-sample2"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/line-bot-sample2-task-definition:25" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/line-bot-sample2-task-definition:25" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "CONTAINER_TAG"
                          - value = "0.0.1-b3b9e8d"
                        },
                      - {
                          - name  = "DB_ADDRESS"
                          - value = "linebot-sample2-rds-mysql.cluster-cdx787qeoakd.ap-northeast-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "DB_DATABASE"
                          - value = "linebotsample2database"
                        },
                      - {
                          - name  = "DB_PORT"
                          - value = "3306"
                        },
                      - {
                          - name  = "DB_USER"
                          - value = "user"
                        },
                    ]
                  - essential        = true
                  - image            = "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/line-bot-sample2-app:0.0.1-b3b9e8d"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/line-bot-sample2"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "line-bot-sample2-app"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "DB_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/MYSQL_PASSWORD"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "line-bot-sample2-task-definition" -> (known after apply)
      ~ revision                 = 25 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.rds.aws_db_subnet_group.this must be replaced
-/+ resource "aws_db_subnet_group" "this" {
      ~ arn         = "arn:aws:rds:ap-northeast-1:554506578892:subgrp:linebot-sample2-rds-mysql" -> (known after apply)
      ~ description = "linebot-sample2-rds-mysql" -> "line-bot-sample2-rds-mysql"
      ~ id          = "linebot-sample2-rds-mysql" -> (known after apply)
      ~ name        = "linebot-sample2-rds-mysql" -> "line-bot-sample2-rds-mysql" # forces replacement
      + name_prefix = (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.rds.aws_eip.handson_debug_public_eip will be created
  + resource "aws_eip" "handson_debug_public_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.rds.aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "ec2-private-debug-natgw-0"
        }
      + tags_all             = {
          + "Name" = "ec2-private-debug-natgw-0"
        }
      + vpc                  = true
    }

  # module.rds.aws_eip.nat_1a will be created
  + resource "aws_eip" "nat_1a" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "handson-natgw-1a"
        }
      + tags_all             = {
          + "Name" = "handson-natgw-1a"
        }
      + vpc                  = true
    }

  # module.rds.aws_eip.public_eip will be created
  + resource "aws_eip" "public_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.rds.aws_instance.handson_private will be created
  + resource "aws_instance" "handson_private" {
      + ami                                  = "ami-0f037327d64de9e49"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "mmm2"
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "handson-LINE-private-1"
        }
      + tags_all                             = {
          + "Name" = "handson-LINE-private-1"
        }
      + tenancy                              = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + credit_specification {
          + cpu_credits = "unlimited"
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.rds.aws_instance.handson_public will be created
  + resource "aws_instance" "handson_public" {
      + ami                                  = "ami-0f037327d64de9e49"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "mmm2"
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "handson-LINE-public-bastiation-1"
        }
      + tags_all                             = {
          + "Name" = "handson-LINE-public-bastiation-1"
        }
      + tenancy                              = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + credit_specification {
          + cpu_credits = "unlimited"
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.rds.aws_instance.private will be created
  + resource "aws_instance" "private" {
      + ami                                  = "ami-0f037327d64de9e49"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "mmm2"
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "LINE-private-0"
        }
      + tags_all                             = {
          + "Name" = "LINE-private-0"
        }
      + tenancy                              = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + credit_specification {
          + cpu_credits = "unlimited"
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.rds.aws_instance.public will be created
  + resource "aws_instance" "public" {
      + ami                                  = "ami-0f037327d64de9e49"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "mmm2"
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "LINE-public-bastiation-0"
        }
      + tags_all                             = {
          + "Name" = "LINE-public-bastiation-0"
        }
      + tenancy                              = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + credit_specification {
          + cpu_credits = "unlimited"
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.rds.aws_internet_gateway.debug-ec2-main will be created
  + resource "aws_internet_gateway" "debug-ec2-main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "main"
        }
      + tags_all = {
          + "Name" = "main"
        }
      + vpc_id   = (known after apply)
    }

  # module.rds.aws_nat_gateway.nat_1a will be created
  + resource "aws_nat_gateway" "nat_1a" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "handson-1a"
        }
      + tags_all             = {
          + "Name" = "handson-1a"
        }
    }

  # module.rds.aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-0bb63a2f82ac5687b"
      + tags                 = {
          + "Name" = "line-bot-nat-gateway-diff"
        }
      + tags_all             = {
          + "Name" = "line-bot-nat-gateway-diff"
        }
    }

  # module.rds.aws_network_interface.handson_private_interface_debug will be created
  + resource "aws_network_interface" "handson_private_interface_debug" {
      + id                 = (known after apply)
      + ipv6_address_count = (known after apply)
      + ipv6_addresses     = (known after apply)
      + mac_address        = (known after apply)
      + outpost_arn        = (known after apply)
      + private_dns_name   = (known after apply)
      + private_ip         = (known after apply)
      + private_ips        = (known after apply)
      + private_ips_count  = (known after apply)
      + security_groups    = (known after apply)
      + source_dest_check  = true
      + subnet_id          = (known after apply)
      + tags               = {
          + "Name" = "handson_private_debug_network_interface"
        }
      + tags_all           = {
          + "Name" = "handson_private_debug_network_interface"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.rds.aws_network_interface.handson_public_interface_debug will be created
  + resource "aws_network_interface" "handson_public_interface_debug" {
      + id                 = (known after apply)
      + ipv6_address_count = (known after apply)
      + ipv6_addresses     = (known after apply)
      + mac_address        = (known after apply)
      + outpost_arn        = (known after apply)
      + private_dns_name   = (known after apply)
      + private_ip         = (known after apply)
      + private_ips        = (known after apply)
      + private_ips_count  = (known after apply)
      + security_groups    = (known after apply)
      + source_dest_check  = true
      + subnet_id          = (known after apply)
      + tags               = {
          + "Name" = "handson_public_debug_network_interface"
        }
      + tags_all           = {
          + "Name" = "handson_public_debug_network_interface"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.rds.aws_network_interface.private_interface_debug will be created
  + resource "aws_network_interface" "private_interface_debug" {
      + id                 = (known after apply)
      + ipv6_address_count = (known after apply)
      + ipv6_addresses     = (known after apply)
      + mac_address        = (known after apply)
      + outpost_arn        = (known after apply)
      + private_dns_name   = (known after apply)
      + private_ip         = (known after apply)
      + private_ips        = (known after apply)
      + private_ips_count  = (known after apply)
      + security_groups    = (known after apply)
      + source_dest_check  = true
      + subnet_id          = "subnet-0d00944d99dfe3fb9"
      + tags               = {
          + "Name" = "private_debug_network_interface"
        }
      + tags_all           = {
          + "Name" = "private_debug_network_interface"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.rds.aws_network_interface.public_interface_debug will be created
  + resource "aws_network_interface" "public_interface_debug" {
      + id                 = (known after apply)
      + ipv6_address_count = (known after apply)
      + ipv6_addresses     = (known after apply)
      + mac_address        = (known after apply)
      + outpost_arn        = (known after apply)
      + private_dns_name   = (known after apply)
      + private_ip         = (known after apply)
      + private_ips        = (known after apply)
      + private_ips_count  = (known after apply)
      + security_groups    = (known after apply)
      + source_dest_check  = true
      + subnet_id          = "subnet-0bb63a2f82ac5687b"
      + tags               = {
          + "Name" = "public_debug_network_interface"
        }
      + tags_all           = {
          + "Name" = "public_debug_network_interface"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.rds.aws_rds_cluster.this must be replaced
-/+ resource "aws_rds_cluster" "this" {
      + apply_immediately                   = (known after apply)
      ~ arn                                 = "arn:aws:rds:ap-northeast-1:554506578892:cluster:linebot-sample2-rds-mysql" -> (known after apply)
      ~ availability_zones                  = [
          - "ap-northeast-1a",
          - "ap-northeast-1c",
          - "ap-northeast-1d",
        ] -> (known after apply)
      - backtrack_window                    = 0 -> null
      ~ cluster_identifier                  = "linebot-sample2-rds-mysql" -> "line-bot-sample2-rds-mysql" # forces replacement
      + cluster_identifier_prefix           = (known after apply)
      ~ cluster_members                     = [
          - "linebot-sample2-rds-mysql",
        ] -> (known after apply)
      ~ cluster_resource_id                 = "cluster-3F4A5RVOLX3TBQKQCBX2MK24OA" -> (known after apply)
      ~ db_cluster_parameter_group_name     = "linebot-sample2-rds-mysql" -> "line-bot-sample2-rds-mysql"
      ~ db_subnet_group_name                = "linebot-sample2-rds-mysql" -> "line-bot-sample2-rds-mysql" # forces replacement
      - deletion_protection                 = false -> null
      - enabled_cloudwatch_logs_exports     = [] -> null
      ~ endpoint                            = "linebot-sample2-rds-mysql.cluster-cdx787qeoakd.ap-northeast-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version                      = "5.7.mysql_aurora.2.07.2" -> (known after apply)
      - global_cluster_identifier           = "" -> null
      ~ hosted_zone_id                      = "Z24O6O9L7SGTNB" -> (known after apply)
      - iam_database_authentication_enabled = false -> null
      - iam_roles                           = [] -> null
      ~ id                                  = "linebot-sample2-rds-mysql" -> (known after apply)
      ~ kms_key_id                          = "" -> (known after apply)
      ~ preferred_backup_window             = "15:04-15:34" -> (known after apply)
      ~ preferred_maintenance_window        = "mon:18:23-mon:18:53" -> (known after apply)
      ~ reader_endpoint                     = "linebot-sample2-rds-mysql.cluster-ro-cdx787qeoakd.ap-northeast-1.rds.amazonaws.com" -> (known after apply)
      - replication_source_identifier       = "" -> null
      ~ storage_encrypted                   = false -> (known after apply)
      - tags                                = {} -> null
      ~ tags_all                            = {} -> (known after apply)
      ~ vpc_security_group_ids              = [
          - "sg-08ac515ab6e8ebdf7",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.rds.aws_rds_cluster_instance.this must be replaced
-/+ resource "aws_rds_cluster_instance" "this" {
      + apply_immediately               = (known after apply)
      ~ arn                             = "arn:aws:rds:ap-northeast-1:554506578892:db:linebot-sample2-rds-mysql" -> (known after apply)
      ~ availability_zone               = "ap-northeast-1d" -> (known after apply)
      ~ ca_cert_identifier              = "rds-ca-2019" -> (known after apply)
      ~ cluster_identifier              = "linebot-sample2-rds-mysql" -> (known after apply) # forces replacement
      ~ db_parameter_group_name         = "default.aurora-mysql5.7" -> (known after apply)
      ~ db_subnet_group_name            = "linebot-sample2-rds-mysql" -> (known after apply)
      ~ dbi_resource_id                 = "db-O25JJLX645IO4CDHD5SLEUFGDQ" -> (known after apply)
      ~ endpoint                        = "linebot-sample2-rds-mysql.cdx787qeoakd.ap-northeast-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version                  = "5.7.mysql_aurora.2.07.2" -> (known after apply)
      ~ id                              = "linebot-sample2-rds-mysql" -> (known after apply)
      ~ identifier                      = "linebot-sample2-rds-mysql" -> "line-bot-sample2-rds-mysql" # forces replacement
      + identifier_prefix               = (known after apply)
      + kms_key_id                      = (known after apply)
      + monitoring_role_arn             = (known after apply)
      ~ performance_insights_enabled    = false -> (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      ~ port                            = 3306 -> (known after apply)
      ~ preferred_backup_window         = "15:04-15:34" -> (known after apply)
      ~ preferred_maintenance_window    = "sat:17:43-sat:18:13" -> (known after apply)
      ~ storage_encrypted               = false -> (known after apply)
      - tags                            = {} -> null
      ~ tags_all                        = {} -> (known after apply)
      ~ writer                          = true -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.rds.aws_rds_cluster_parameter_group.this must be replaced
-/+ resource "aws_rds_cluster_parameter_group" "this" {
      ~ arn         = "arn:aws:rds:ap-northeast-1:554506578892:cluster-pg:linebot-sample2-rds-mysql" -> (known after apply)
      ~ id          = "linebot-sample2-rds-mysql" -> (known after apply)
      ~ name        = "linebot-sample2-rds-mysql" -> "line-bot-sample2-rds-mysql" # forces replacement
      + name_prefix = (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      + parameter {
          + apply_method = "immediate"
          + name         = "time_zone"
          + value        = "Asia/Tokyo"
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "time_zone" -> null
          - value        = "asia/tokyo" -> null
        }
        # (5 unchanged blocks hidden)
    }

  # module.rds.aws_route.private_1a will be created
  + resource "aws_route" "private_1a" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.rds.aws_route.privates will be created
  + resource "aws_route" "privates" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0b7249501f7f39f80"
      + state                  = (known after apply)
    }

  # module.rds.aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.rds.aws_route_table.private_1a will be created
  + resource "aws_route_table" "private_1a" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "handson-private-1a"
        }
      + tags_all         = {
          + "Name" = "handson-private-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.rds.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "handson-public"
        }
      + tags_all         = {
          + "Name" = "handson-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.rds.aws_route_table_association.private_1a will be created
  + resource "aws_route_table_association" "private_1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.rds.aws_route_table_association.public_1a will be created
  + resource "aws_route_table_association" "public_1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.rds.aws_security_group.ec2_private will be created
  + resource "aws_security_group" "ec2_private" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ec2_private"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0b9c9dcab97f3491c"
    }

  # module.rds.aws_security_group.ec2_private_nat_to_global will be created
  + resource "aws_security_group" "ec2_private_nat_to_global" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
        ]
      + name                   = "ec2_private_nat_to_global"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0b9c9dcab97f3491c"
    }

  # module.rds.aws_security_group.ec2_public_bastian will be created
  + resource "aws_security_group" "ec2_public_bastian" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "ec2_bastian"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0b9c9dcab97f3491c"
    }

  # module.rds.aws_security_group.example will be created
  + resource "aws_security_group" "example" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "example"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "example"
        }
      + tags_all               = {
          + "Name" = "example"
        }
      + vpc_id                 = "vpc-0b9c9dcab97f3491c"
    }

  # module.rds.aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "handson_all_ec2_bastian"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.rds.aws_security_group.mysql_to_private will be created
  + resource "aws_security_group" "mysql_to_private" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "mysql_to_private"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0b9c9dcab97f3491c"
    }

  # module.rds.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "line-bot-sample2-rds-mysql"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "line-bot-sample2-rds-mysql"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "line-bot-sample2-rds-mysql"
        }
      + tags_all               = {
          + "Name" = "line-bot-sample2-rds-mysql"
        }
      + vpc_id                 = "vpc-0b9c9dcab97f3491c"
    }

  # module.rds.aws_security_group.this will be destroyed
  - resource "aws_security_group" "this" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:554506578892:security-group/sg-08ac515ab6e8ebdf7" -> null
      - description            = "linebot-sample2-rds-mysql" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-08ac515ab6e8ebdf7" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = ""
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3306
            },
        ] -> null
      - name                   = "linebot-sample2-rds-mysql" -> null
      - owner_id               = "554506578892" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "linebot-sample2-rds-mysql"
        } -> null
      - tags_all               = {
          - "Name" = "linebot-sample2-rds-mysql"
        } -> null
      - vpc_id                 = "vpc-0b9c9dcab97f3491c" -> null
    }

  # module.rds.aws_security_group_rule.in_icmp will be created
  + resource "aws_security_group_rule" "in_icmp" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "icmp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

  # module.rds.aws_security_group_rule.in_ssh will be created
  + resource "aws_security_group_rule" "in_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.rds.aws_security_group_rule.out_all will be created
  + resource "aws_security_group_rule" "out_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.rds.aws_subnet.debug_private_1a will be created
  + resource "aws_subnet" "debug_private_1a" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.10.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "debug_handson-private-1a"
        }
      + tags_all                        = {
          + "Name" = "debug_handson-private-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.rds.aws_subnet.debug_public_1a will be created
  + resource "aws_subnet" "debug_public_1a" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "debug-handson-public-1a"
        }
      + tags_all                        = {
          + "Name" = "debug-handson-public-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.rds.aws_vpc.debug will be created
  + resource "aws_vpc" "debug" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "handson"
        }
      + tags_all                         = {
          + "Name" = "handson"
        }
    }

Plan: 40 to add, 1 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*